package com.AppsFruit.veluthachan;



import android.app.Activity;
import android.graphics.Typeface;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class novena extends Activity {
	
	
	/** Called when the activity is first created. */
	@Override
	public void onCreate(Bundle savedInstanceState) {
	    super.onCreate(savedInstanceState);
	    super.setContentView(R.layout.novena);
	    
	    TextView tv=(TextView)findViewById(R.id.text);
	    TextView name=(TextView)findViewById(R.id.day_name);
	    name.setText("വി .സെബസ്ത്യാനോസിന്റെ നൊവേന");
	   
	    
	    
		Typeface typeFace = Typeface.createFromAsset(getAssets(),"AnjaliOldLipi.ttf");
		tv.setText(
				"\nപ്രാരംഭഗാനം\n\nആകുല മാനസരായ്\n ആണയും നിന്മക്കൾ ഞങ്ങൾ" +
				"\nശാന്തി യരുളണംമേ\nവി .സെബസ്ത്യാനോസിനോസെ\n\n          ആകുല..\n\n" +
				"ക്രിസ്തുവാം രക്ഷകൻ തൻ സ്നേഹ ഭാജനമേ\nനിൻ തൃപാദം ഞങ്ങൾ \nവന്ദിച്ചു പൂജിക്കുന്നു\n\n          ആകുല..\n\nസത്യ വിശ്വാസത്തിനയി രക്തം" +
				"\nചോരിഞ്ഞവനെ നൽവരം നൽകിടണേ\nധീരനാം പുണ്യആത്മാവേ\n\n          ആകുല..\n\n" +
				" പ്രാരംഭ പ്രാർത്ഥന\n\n" + "ഞങ്ങളുടെ /ആശ്രയമായ /വി.സെബസ്ത്യാനോസെ .." +"/ജീവിത ക്ലേശങ്ങളും /ഭാരങ്ങളുമായി /ഉയിരുള്ള " +
				"വിശ്വാസത്തോടെ /ഓടിയണഞ്ഞിരിക്കുന്ന/ " + "ഞങ്ങളെ /അങ്ങയുടെ/കരങ്ങളാൽ/ " +
				"ആശ്വസിപ്പികണമേ ." + "അങ്ങയെ അനുകരിച്ചു /ഞങ്ങളുടെ /" + "സഹോദരങ്ങളിൽ /ക്രിസ്തുവിനെ/കണ്ടെത്തുവാനുള്ള/ "+
				"ആത്മീയ ചൈതന്യം /ഞങ്ങള്ക്ക് /അരുള്ളണ്ണം എന്ന്"+ "എളിമയോടെ / പ്രാർത്ഥിക്കുന്നു ..." +
				"\n                                   അമ്മേൻ " +
				"\n\nവിശുദ്ധിയെന്ന പുണ്യത്തെ /അളവറ്റു " + "സ്നേഹിച്ച്/ ആജീവനാന്തം/ശുദ്ധത "+ "പാലിച്ചിരുന്ന/വി.സെബസ്ത്യാനോസെ.." +
				"/നിർമ്മലമായ ജീവിതം /കാഴ്ച്ചവയ്ക്കുവാനും"+ "പ്രലോഭന / സാഹചര്യങ്ങളെ/ വിട്ടകന്നു "+  "ജീവിക്കുവാനും /ഞങ്ങളെ /പ്രാപ്തരാക്കാണമേ " +
				"ഞങ്ങളുടെ / കുടുംബങ്ങൾ / വിശുദ്ധിയുടെ  " + "പര്യായായങ്ങളായി / പരിലസിക്കുവാൻ  /" + "തുണയായിരിക്കുവയും  / ചെയ്യണമേ .." +
				"\n\n                                അമ്മേൻ  " +
		
				
				
		"\nക്രിസ്തുവിന്റെ /മൌതീക /ശരീരമായ/തിരുസഭയെ /അത്യന്തം സ്നേഹിക്കുകയും സകല കഴിവുകളും /സഭയുടെ സേവനത്തിനായി /" +
		"അർപ്പിക്കുകയും  ചെയ്ത /വി.സെബസ്ത്യാനോസെ.. "+		
		"അങ്ങയുടെ/സ്വർഗീയ/മാദ്ധ്യസ്ഥത്താൽ /ദൈവജനത്തെ  /കാത്തുപാലിക്കണമേ /കൂരമ്പ്‌യെറ്റു/പ്രാണവേതന   " +
		"/ അനുഭവിച്ച വേളയിലും " + 														
		"സത്യവിശ്വാസം ഏറ്റു പറഞ്ഞ് /രക്തസാക്ഷിത്തം വരിച്ച /മഹാ ധീരനായ വി.സെബസ്ത്യാനോസെ ,/ഞങ്ങളും /സഭയ്ക്കുവേണ്ടി /ജീവിക്കുകയും"+								 
        "മരിക്കുകയും /ചെയ്തുകൊള്ളാമെന്നു /ഒരിക്കൽകുടി /വാഗ്ദാനം/ചെയ്യുന്നു /സഭയ്ക്ക് എതിരായി /നീങ്ങുന്ന / ശക്തികളെ സുധീരം / നെരിടുവാനുള്ള" +
		"ആത്മീയ ധൈര്യം/ഞങ്ങളിൽ  /വർധിപ്പികന്നമെ.ഞങ്ങൾ  /അങ്ങയുടെ / മാതൃകയെ /അനുകരിച്ച് /ദൈവസ്നേഹത്തിലും/"+
        "പരസ്പരസ്നേഹത്തിലും  വർത്തികുവാനും "+
        "കടമകളെ /വിശ്വസ്തതാ പൂർവ്വം /നിർവഹിച്ച്/നല്ലമരണം /വരിച്ച്  /സ്വർഗരാജ്യം /പ്രാപിക്കുവാനുള്ള  /അനുഗ്രഹം /തന്നു അരുളുകയും ചെയ്യണമേ ....." +
	    "\nഅമ്മേൻ " +
        "\n\nനവനാൾ  ജപം\n\n" +
	    "ജീവിത മാതൃകയാൽ/ ലോകത്തെ പ്രഭാപൂരിതമാക്കുവാൻ / ക്ലേശങ്ങൾ സഹിച്ച / വി. സെബസ്ത്യാനോസെ/ എളിമയുടെയും / വിനയതിന്റെയും / "+
        "സ്നേഹത്തിന്റെയും /സേവനത്തിന്റെയും /അനുസരണയുടെയും /ഉത്തമ മാതൃക/ അങ്ങ് ഞങ്ങള്ക്ക് / കാണിച്ചു തന്നു വല്ലോ / ഞങ്ങളേയും / "+
	    "ഞങ്ങളുടെ / ജീവിതത്തിലെ / സുഖദു:ഖങ്ങളെയും / അങ്ങയ്ക്കു / ഞങ്ങൾ കാഴ്ച്ച വയ്ക്കുന്നു. /അന്ധകാരവൃതമായ / ജീവിത യാത്രയിൽ / ഞങ്ങള്ക്ക് "+
        "കിടാവിളക്കയിരിക്കണമേ/ വിശ്വാസത്തോടും ദുഖഭാരത്തോടും കുടി / അങ്ങയോടു ഞങ്ങൾ പ്രാർഥിക്കുന്നു /.ബുദ്ധിമുട്ടുകളിലും/ പ്രയാസങ്ങളിലും /" +
	    "മനോവേദനകളിലും/ രോഗങ്ങളിലും / ന്യൈരാശ്യത്തിലും / നീ / ഞങ്ങള്ക്ക് / രക്ഷസങ്ക്കേതമായിരിക്കണമേ/ പരസ്പരം ക്ഷമിക്കുവാനും /"+
        "ജീവിതക്ലേശങ്ങൾ / സന്തോഷപൂർവം / സ്വീകരിക്കുവാനും / ഞങ്ങളെ / പടിപ്പിക്കണമേ/.ഞങ്ങൾ നിർമ്മലമാനസരയി / ജീവിക്കുവാനും "+
	    "അശ്വാസതിന്റെയും / നന്മ്മയുടെയും / കിരണങ്ങൾ / മറ്റുള്ളവർക്ക് / പകർന്നു കൊടുക്കുന്നവരായി / പരിണമിക്കുവാനും/ കൃപയരുലളണമേ/ ഞങ്ങളെ "+
        "അങ്ങ് സംരക്ഷിക്കുകയും / നേർവഴിയിലൂടെ / നടത്തുകയും / എല്ലവിത വിപത്തുകളിൽ നിന്നും / കാത്തു രക്ഷിക്കുകയും / ചെയ്യണമേ /."+
	    "അപേക്ഷിക്കുന്നവരെ / കൈവിടാത്ത / മഹാ അത്ഭുതപ്രവർത്തകനായ / വി. സെബസ്ത്യാനോസെ/ ഞങ്ങൾ / അഭ്യർതിക്കുന്ന / പ്രത്യേക / ആവശ്യം " +
        "/(ആവശ്യം  പറയുക )/ ഞങ്ങളുടെ കർത്താവായ / ഈശോമിശിഹയുടെ/ സഹായത്താൽ / സാധിച്ചുതരണമേന്നു / അങ്ങയോടു / ഞങ്ങൾ /"+
	    "അപേക്ഷിക്കുന്നു / അമ്മേൻ /........" +
	    "\n\nലുത്തീനിയ \n\n" +
	    "\n കർത്താവേ അനുഗ്രഹിക്കണമേ"+ 
	    "\nമിശിഹായെ അനുഗ്രഹിക്കണമേ"+
	    "\nകർത്താവേ അനുഗ്രഹിക്കണമേ"+
	    "\nമിശിഹായെ ഞങ്ങളുടെ പ്രാർത്ഥന കേൾക്കണമേ"+
	    "\n\nസ്വർഗ്ഗസ്ഥനായ ദൈവപിതാവേ"+
	    "\n\nലോകരക്ഷകനായ ദൈവപുത്രാ "+
	    "\n\nപരിശുദ്ധാരൂപിയായ ദൈവമേ "+
	    "\n\nത്രിത്വൈക ദൈവമേ "+
	    "\n\nവേദസക്ഷികളുടെ രാജ്ജിയായ പരിശുദ്ധമാതാവേ "+
	    "\n\nവി. സെബസ്ത്യാനോസെ.."+
	    "\n\nനന്മകളുടെ വിളനിലമായ വി.സെ.. "+
	    "\n\nവേദഞ്ഞെരുക്കങ്ങളിൽ പിഡയനുഭാവിക്കുനവരെ ധൈരപ്പെടുത്തിയ വി.സെ..\n"+
	    "\n\nജ്ഞാനത്താൽ  പ്രകാശിച്ച വി.സെ .."+
	    "\n\nറോമാ ചക്രവർത്തിയുടെ പടനായകനായിട്ടും ദൈവസേവനത്തിൽ വിശ്വസ്തനായിരുന്ന  വി.സെ.. \n"+
	    "\n\nഞങ്ങളുടെ സങ്ക്കെതവും അശ്രയവുമായ വി.സെ .."+
	    "\n\nതന്റെ ജനനത്തൽ നരബോനാ നഗരിയെ വിശ്രുതമാക്കിയ വി.സെ.. \n\n"+
	    "\n\nതിരുസഭയ്ക്ക് സഹായമായിരുന്ന വി.സെ..\n"+
	    "\n\nസുവിശേഷ വെളിച്ചത്തെ പ്രസംഗിച്ചുതെളിച്ച വി.സെ.. " +
	    "\n\nഅടർകളത്തിലെന്ന പോലെ അത്യാത്മീക സമരത്തിലും ശക്തനായ വി.സെ ..\n"+
	    "\n\nവേദസാക്ഷി മകുടം ചൂടിയ വി.സെ .."+
	    "\n\nമരകരോഗങ്ങളിൽ നിന്നും ഭക്തരെ സംരക്ഷിക്കുന്ന വി.സെ.. \n"+
	    "\n\nരോഗികള്ക്ക് ആശ്വാസംകൊടുത്ത വി.സെ .."+
	    "\n\nനിരവധി അസ്ത്ങ്ങളാൽ വൃണപ്പെട്ട വി.സെ.."+
	    "\n\nഅസാമാന്യ ധൈര്യത്തോടെ രാജാവിനെ കുറ്റപ്പെടുത്തിയ വി.സെ.. \n"+
	    "\n\nക്രുരമായ അടികളേറ്റു മരണം വരിച്ച വി.സെ .."+
	    "\n\nദൈവ സ്നേഹത്തെ പ്രതി ജീവിതാര്പണം ചെയ്ത വി.സെ .."+
	    "\n\nലൌകീക ആസക്തികളെ അതിജീവിച്ച വി.സെ .."+
	    "\n\nസഹനത്തിലൂടെ സ്നേഹസാക്ഷിയായ വി.സെ .."+
	    "\n\nദരിദ്രർക്ക്  കരുണാർദ്ര സ്നേഹിതനായ വി.സെ .." +
	    "\n\nസ്വധർമ്മത്തിൽ വിശ്വസ്തത പാലിച്ച വി.സെ .."+
	    
		"\n\nലോകത്തിന്റെ പാപങ്ങൾ നീക്കുന്ന ദൈവത്തിന്റെ കുഞ്ഞാടെ "+
		"\n\nകർത്താവേ , ഞങ്ങളുടെ പാപങ്ങൾ പൊറുക്കണമേ "+
		"\n\nലോകത്തിന്റെ പാപങ്ങൾ നീക്കുന്ന ദൈവത്തിന്റെ കുഞ്ഞാടെ"+ 
		"\n\nകർത്താവേ , ഞങ്ങളുടെ പ്രാർത്ഥന കൈക്കൊള്ളണമേ"+
		"\n\nലോകത്തിന്റെ പാപങ്ങൾ നീക്കുന്ന ദൈവത്തിന്റെ കുഞ്ഞാടെ"+
		"\n\nകർത്താവേ , ഞങ്ങളെ  അനുഗ്രഹിക്കണമേ"+
		
"\n\nപുരോ :ഈശോമിശിഹായുടെ വാഗ്ദാനങ്ങൾക്ക് ഞങ്ങൾ യോഗ്യരാകുവാൻ"+

"\n\nജനം: വി.സെ ഞങ്ങള്ക്ക് വേണ്ടി അപേക്ഷിക്കണമേ" +
"\n\nനമ്മുക്ക് പ്രാർത്ഥിക്കാം\n" +
"\nരക്ത സാക്ഷിയായ വി. സെബസ്ത്യാനോസിനു ധീരത നല്കിയ ദൈവമേ, വിശുദ്ധന്റെ സഹായമപേക്ഷിക്കുന്ന അങ്ങേ മക്കളുടെ പ്രാര്ത്ഥന " +
"സ്വീകരിക്കുകയും ജീവിത പ്രശ്നങ്ങളിൽ തുണയായിരിക്കുകയും ചെയ്യണമേ." +
" ഞങ്ങളും ഒരിക്കൽ വിശുനോടോത്തു സ്വർഗ്ഗരാജ്യത്തിൽ അനവരതം അവിടുത്തെ വാഴ്ത്തി സ്തുതിക്കുവാൻ കൃപയരുളുകയും ചെയ്യണമേ ..." +
"\n\n                                                                  അമ്മേൻ\n\n" 


	    
	    
				
	    
	    
				
				);

		tv.setMovementMethod(new ScrollingMovementMethod());
		tv.setTypeface(typeFace);
		name.setTypeface(typeFace);
	    
	
	    // TODO Auto-generated method stub
	}

}
